## HTTP
*인터넷 상에서 클라이언트와 서버가 자원을 주고 받을 때 쓰는 통신 규약*
- HTTP에는 method가 존재한다.
- HTTP는 암호화 과정이 없어 누군가 네트워크에서 신호를 가로채면 내용이 그대로 노출되는 보안 이슈가 존재한다.
> 자주 쓰는 HTTP methods
- `GET` : 조회헐 때 사용
- `POST` : 생성할 때 사용(상태를 수정)
- `PUT` : 내용을 수정할 때 사용
- `DELETE` :  내용을 삭제할 때 사용
<br>
<hr>


## HTTPS
*인터넷 상에서 정보를 암호화하는 SSL프로토콜을 사용하여 클라이언트와 서버가 자원을 주고 받을 때 사용하는 통신규약*
- HTTPS의 보안 문제를 해결해 주는 프로토콜이다.
> 통신흐름
1. 애플리케이션 서버(A)를 만드는 기업은 HTTPS를 적용하기 위해 공개키와 개인키를 만든다.
2. 신뢰할 수 있는 CA 기업을 선택하고, 그 기업에게 내 공개키 관리를 부탁하며 계약을 한다.
<br><br>

***CA란?*** : Certificate Authority로, 공개키를 저장해주는 신뢰성이 검증된 민간기업 <br><br>

3. 계약 완료된 CA 기업은 해당 기업의 이름, **A서버 공개키, 공개키 암호화 방법을 담은 인증서**를 만들고, 해당 인증서를 **CA 기업의 개인키로 암호화해서 A서버에게 제공**한다.
4. **A서버는 암호화된 인증서를 갖게 되었다**. 이제 A서버는 **A서버의 공개키로 암호화된 HTTPS 요청이 아닌 요청이 오면**, 이 **암호화된 인증서를 클라이언트에게 건내준다.**
5. 클라이언트가 `main.html` 파일을 달라고 A서버에 요청했다고 가정하자. **HTTPS 요청이 아니기 때문에 CA기업이 A서버의 정보를 CA 기업의 개인키로 암호화한 인증서**를 받게 된다.
<br><br>

**CA 기업의 공개키는 브라우저가 이미 알고있다.** (세계적으로 신뢰할 수 있는 기업으로 등록되어 있기 때문에, 브라우저가 인증서를 탐색하여 해독이 가능한 것) <br><br>

6. **브라우저는 해독한 뒤 A서버의 공개키를 얻게 되**었다. 이제 **A서버와 통신할 때는 얻은 A서버의 공개키로 암호화해서 요청**을 날리게 된다.